85hzc/ask_433/stm32f1_cube/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"
#include "gpio.h"
#include "mbi5153.h"
#include "delay.h"
#include "drv_ir.h"
#include "drv_serial.h"
#include "softspi.h"
#include "programs.h"
#include "config.h"
#include "oppRFTask.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

uint8_t                  scenMode = 0;
BOOL                     runFlag;
BOOL                     powerFlag;
uint16_t                 fileTotalPhoto;  //静态图片数
uint16_t                 fileTotalFilm[MAX_FILM_FOLDER]; //每个影片的帧数
uint8_t                  filmTotalProgram;  //Film目录下的影片个数
uint8_t                  single_cmd[CMD_LEN_MAX];
uint16_t                 actType = 1;
uint16_t                 actTime = 100;
BOOL                     usartTxFlag = false;

#if(PROJECTOR_CUBE)
uint8_t                  usartTxData[3];
uint16_t                 brightness = 0;
BOOL                     lightingStatus;

#elif(CUBEPLT_MASTER)
uint8_t                  usartTxData[1024];
#elif(PROJECTOR_OSRAM)
extern uint8_t           eplosSLPxen;
extern BOOL              eplosCfgFlag;
#endif

oppRfFlag_t             gOppRfFlag;
ST_OPP_BLE_MsgBuf_t     gOppBleMsg;
uint8_t                 msgBuf[128];

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef       huart1, huart2, huart3;
DMA_HandleTypeDef        hdma_usart1_rx, hdma_usart2_rx, hdma_usart3_rx;
DMA_HandleTypeDef        hdma_usart1_tx, hdma_usart2_tx, hdma_usart3_tx;
USART_RECEIVETYPE        UsartType1, UsartType2, UsartType3;

TIM_HandleTypeDef        htim1,htim2;
TIM_HandleTypeDef        htim3;
SPI_HandleTypeDef        hspi1,hspi2;

extern volatile uint16_t I2C_SDA_PIN;
extern volatile uint16_t I2C_SCL_PIN;

extern uint8_t           photoProgramIdx;
extern uint8_t           filmProgramIdx;
extern uint8_t           filmFrameIdx;
extern PROGRAMS_TYPE_E   programsType;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define DEBUG_UART       huart3

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
extern void Drv_PWM_Init(void);
extern void Drv_PWM_Proc(void);
void I2C_init(void);
void UartDebugControlHandle(uint8_t *key);
#if PROJECTOR_CUBE
void AppControlCubeHandle(uint8_t *key);
void oppRFMsgSendProc();
void oppRFMsgRecvCallBack(uint8_t *data);
#endif
#if PROJECTOR_OSRAM
void AppControlEplosHandle(uint8_t *key);
void oppRFMsgSendProc();
void oppRFMsgRecvCallBack(uint8_t *data);
#endif
#if CUBEPLT_SLAVE
void AppControlCubePltHandle(uint8_t *key,uint16_t len);
#endif

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

void MX_SPI1_Init(void)
{
    hspi1.Instance = SPI1;
    hspi1.Init.Mode = SPI_MODE_MASTER;//主模式
    hspi1.Init.Direction = SPI_DIRECTION_2LINES;//全双工
    hspi1.Init.DataSize = SPI_DATASIZE_8BIT;//数据位为8位
    hspi1.Init.CLKPolarity = SPI_POLARITY_HIGH;//CPOL=0,low
    hspi1.Init.CLKPhase = SPI_PHASE_2EDGE;//CPHA为数据线的第一个变化沿
    hspi1.Init.NSS = SPI_NSS_SOFT;//软件控制NSS
    hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;//2分频，32M/2=16MHz
    hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;//最高位先发送
    hspi1.Init.TIMode = SPI_TIMODE_DISABLE;//TIMODE模式关闭
    hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;//CRC关闭
    hspi1.Init.CRCPolynomial = 7;//默认值，无效
    if (HAL_SPI_Init(&hspi1) != HAL_OK)//初始化
    {
        Error_Handler();
    }
}

void MX_SPI2_Init(void)
{
    hspi2.Instance = SPI2;
    hspi2.Init.Mode = SPI_MODE_MASTER;//主模式
    hspi2.Init.Direction = SPI_DIRECTION_2LINES;//全双工
    hspi2.Init.DataSize = SPI_DATASIZE_8BIT;//数据位为8位
    hspi2.Init.CLKPolarity = SPI_POLARITY_HIGH;//CPOL=0,low
    hspi2.Init.CLKPhase = SPI_PHASE_2EDGE;//CPHA为数据线的第一个变化沿
    hspi2.Init.NSS = SPI_NSS_SOFT;//软件控制NSS
    hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_128;//2分频，32M/2=16MHz
    //hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;//2分频，32M/2=16MHz

    hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;//最高位先发送
    hspi2.Init.TIMode = SPI_TIMODE_DISABLE;//TIMODE模式关闭
    hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;//CRC关闭
    hspi2.Init.CRCPolynomial = 7;//默认值，无效
    if (HAL_SPI_Init(&hspi2) != HAL_OK)//初始化
    {
        Error_Handler();
    }
}

