85hzc/ask_433/stm32f1_cube/Src/main.c
/******************************************************************************
 Function    : oppRFMsgSendProc
 Description : RF 消息发送
 Note        : (none)
 Input Para  : (none)
 Output Para : (none)
 Return      : (none)
 Other       : (none)
******************************************************************************/
void oppRFMsgSendProc()
{
    u8 curSdLen = 0;
    u8 pkgNum = 0;
    u8 sendBuf[20];
    static u8 msgLen = 0;
    static u8 sdIndex = 0;
    static u32 lastSendTick = 0;
    /*
    if(1 == oppHalUartIsBusy(OPP_RF_UART))
    {
        return;
    }*/

    if((msgLen == 0) && (sdIndex != 0))
    {
        sdIndex = 0;
        gOppRfFlag.isSend = 0;
        gOppRfFlag.isBusy = 0;
        return;
    }

    //if(g_ulOppleSysTick - lastSendTick < 100)
    if(HAL_GetTick() - lastSendTick < 100)        
    {
        return;
    }

    if(sdIndex == 0)
    {
        oppFirstPackage_t *pFisrtPackage = (oppFirstPackage_t *)&sendBuf[0];

        if(gOppBleMsg.msgHeader.pst.ucMsgLen == 0)
        {
            gOppRfFlag.isSend = 0;
            gOppRfFlag.isBusy = 0;
            return;
        }

        OPP_SWAP_S(gOppBleMsg.msgHeader.pstApp.uwMsgType);
        msgLen = gOppBleMsg.msgHeader.pst.ucMsgLen+4;
        if(msgLen <= 17)
        {
            pkgNum = 1;
        }
        else
        {
            pkgNum = 2+(msgLen-17) / 19;
            pkgNum = ((msgLen-17)%19 == 0) ? pkgNum-1 : pkgNum;
        }
        curSdLen = msgLen > 17 ? 17 : msgLen;   
        
        pFisrtPackage->packageHeader.isMultiPackage = msgLen > 17 ? 1 : 0;
        pFisrtPackage->packageHeader.multiPackageType = 0;
        pFisrtPackage->packageHeader.multiPackageIndex = 0;
        pFisrtPackage->totalLen = msgLen+2+pkgNum;
        OPP_SWAP_S(pFisrtPackage->totalLen);
        memcpy(&pFisrtPackage->data[0], &gOppBleMsg.msgBuf[0], curSdLen);       
        msgLen -= curSdLen;
        sdIndex++;
        //oppHalUartSend(OPP_RF_UART, &sendBuf[0], curSdLen+3);
        HAL_UART_Transmit(&huart1, &sendBuf[0], curSdLen+3, 0xffff);
        lastSendTick = HAL_GetTick();
    }
    else
    {
        oppMainPackage_t *pMainPackage = (oppMainPackage_t *)&sendBuf[0];

        if(msgLen == 0)
        {
            sdIndex = 0;
            gOppRfFlag.isSend = 0;
            gOppRfFlag.isBusy = 0;
            return;
        }

        curSdLen = msgLen > 19 ? 19 : msgLen;   

        pMainPackage->packageHeader.isMultiPackage = 1;
        pMainPackage->packageHeader.multiPackageType = msgLen > 19 ? 1 : 2;
        pMainPackage->packageHeader.multiPackageIndex = sdIndex;
        memcpy(&pMainPackage->data[0], &gOppBleMsg.msgBuf[17+ (sdIndex-1)*19], curSdLen);       
        msgLen -= curSdLen;
        sdIndex++;
        //oppHalUartSend(OPP_RF_UART, &sendBuf[0], curSdLen+1);
        HAL_UART_Transmit(&huart1, &sendBuf[0], curSdLen+1, 0xffff);
        lastSendTick = HAL_GetTick();
    }
}
#endif

int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();  //systick 1ms

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
#if(PROJECTOR_CUBE)
    MX_TIM1_Init();//for PWM pulse
#endif
    //MX_TIM2_Init();

#if(IR_REMOTE)
    //MX_TIM3_Init();//for IR INT
    /* Initialize IR state */
    //Drv_IR_Init();
#endif

    appInit();

#if(PROJECTOR_CUBE)
    drv_pwm_speed(brightness);
#endif

#ifdef SUPPORT_FATFS
#ifdef SPI_HARD
    SPI_Configuration();    //SPI初始化
#else
    SPI_GPIO_Soft_Init();
#endif
#endif

    printf("system start.\r\n");

#if 1
    HAL_UART_Receive_DMA(&huart1, UsartType1.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);

    HAL_UART_Receive_DMA(&huart2, UsartType2.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE);

    HAL_UART_Receive_DMA(&huart3, UsartType3.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart3, UART_IT_IDLE);
#else
    HAL_UART_Receive_IT(&huart1, rxData, 5);
#endif

    printf("system init hclk:%d\r\n",HAL_RCC_GetHCLKFreq());

#ifdef SUPPORT_FATFS
#ifdef SPI_HARD
    SD_Init();
#else
    SDInit();
#endif
    printf("SDInit ok!\r\n");
    //SD_ReadFileList("");
    //SD_ReadFileList("/f1");
    //SD_ReadFileList("/f2");
    //SD_fileCopy();           //测试函数
#endif
#if 1
#if(PROJECTOR_OSRAM)
    I2C_init();
    SD_ReadPhotoFileList("/OSRAM/Photo");
    SD_ReadFilmFolderList("/OSRAM/Film");
    
    for(int i=0;i < filmTotalProgram; i++)
    {
        SD_ReadFilmFileList(i);
    }
#elif(PROJECTOR_CUBE)
    SD_ReadPhotoFileList("/WS2801/Photo");
    SD_ReadFilmFolderList("/WS2801/Film");
    
    for(int i=0;i < filmTotalProgram; i++)
    {
        SD_ReadFilmFileList(i);
    }
#elif(CUBEPLT_MASTER)
    //SD_ReadPhotoFileList("/CUBE/Photo");
    SD_ReadFilmFolderList("/CUBE/Film");
    
    for(int i=0;i < filmTotalProgram; i++)
    {
        SD_ReadFilmFileList(i);
    }
#endif
#endif
    printf("Files Ready!\r\n");

#if(PROJECTOR_MBI5124)
    //reg_config();
#endif

    while (1)
    {
#if(PROJECTOR_CUBE)
        Drv_PWM_Proc();
#endif

#if(PROJECTOR_MBI5153)

        MBI5153_X();
        //MBI5153_play();
        //MBI5153_Sink();
#elif(PROJECTOR_MBI5124)

        if(scenMode==0)
            MBI5124_X();
        else if(scenMode==1)
            MBI5124_Sink();
        else if(scenMode==2)
            MBI5124_Play();
#elif(PROJECTOR_MCUGPIO)

        MCUGpio_X();
        //MCUGpio_Sink();
#elif(PROJECTOR_OSRAM)

        OSRAM_config();
        OSRAM_play();
        //Delay_ms(200);
        //EPLOS_status_read();
        //Delay_ms(200);
#elif(PROJECTOR_CUBE)

        WS2801_play();
#elif(PROJECTOR_CUBEPLT)

        CUBE_play();
#endif

        //Delay_ms(5);
        Drv_SERIAL_Proc();
/*
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
        Delay_ms(100);
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
        Delay_ms(100);
*/
    }
}

