85hzc/ask_433/stm32f1_cube/Src/main.c
        if(huart->Instance == USART1)
        {
            UsartType1.RX_Size = UART_RX_LEN - temp;
            UsartType1.RX_flag = 1;
            HAL_UART_Receive_DMA(huart, UsartType1.RX_pData, UART_RX_LEN);
        } else if(huart->Instance == USART2)
        {
            UsartType2.RX_Size = UART_RX_LEN - temp;
            UsartType2.RX_flag = 1;
            HAL_UART_Receive_DMA(huart, UsartType2.RX_pData, UART_RX_LEN);
        } else if(huart->Instance == USART3)
        {
            UsartType3.RX_Size = UART_RX_LEN - temp;
            UsartType3.RX_flag = 1;
            HAL_UART_Receive_DMA(huart, UsartType3.RX_pData, UART_RX_LEN);
        }
    }
}

void oppRFTaskInit()
{
    //oppHalUartInit(OPP_RF_UART, 115200);
    gOppRfFlag.isBusy = 0;
    gOppRfFlag.isRecvHeader = 0;
    gOppRfFlag.isRecv = 0;
    gOppRfFlag.isSend = 0;
}

void UartDebugControlHandle(uint8_t *key)
{
    uint16_t ttt;
    uint16_t IR_code = 0;

    printf("UartDebugControlHandle key:%s,len=%d\r\n",key,UsartType3.RX_Size);

    if(!strcmp(key,"stop"))
    {
        //stop
        runFlag = false;
    }
    else if(!strcmp(key,"start"))
    {
        //play
        runFlag = true;
    }
    else if(!strcmp(key,"next"))
    {
        IR_code = REMOTE_MI_DOWN;
        photoProgramIdx++;
    }
    else if(!strcmp(key,"pre"))
    {
        if(photoProgramIdx>0)
        {
            photoProgramIdx--;
        }
        IR_code = REMOTE_MI_UP;
    }
    else if(!strcmp(key,"poweron"))
    {
        IR_code = REMOTE_MI_POWER;
        powerFlag = powerFlag==true?false:true;
    }
    else //flash time and display scens
    {
        ttt = atoi(key);
        if(ttt>15)
        {
            actTime = ttt-15;
        }
        else if(ttt<=15 && ttt>10)
        {
            if(ttt==11)
                scenMode = 0;
            else if(ttt==12)
                scenMode = 1;
            else if(ttt==13)
                scenMode = 2;
            else if(ttt==14)
                scenMode = 3;
            else if(ttt==15)
                scenMode = 4;
        }
        else
        {
            actType = ttt;
        }

        drv_pwm_speed(ttt);
    }

    if (IR_code) {

        Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_IR, CMD_OP_IR_CODE), IR_code);
    }
}

#if PROJECTOR_OSRAM
void AppControlEplosHandle(uint8_t *data)
{
    uint16_t ttt;
    uint16_t IR_code = 0;

    //printf("AppControlEplosHandle data:%s\r\n",data);

    if(UsartType2.RX_Size<20)
    {
        if(data[9]==0xd && data[10]==0x3 && data[11]==0x0)
        {
            //runFlag = !runFlag;
            IR_code = REMOTE_MI_OK;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = true;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x0)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = false;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x3)
        {
            IR_code = REMOTE_MI_UP;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x2)
        {
            IR_code = REMOTE_MI_LEFT;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_RIGHT;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_PLUS;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x0)
        {
            IR_code = REMOTE_MI_MINUS;
        }

        if (IR_code) {
            Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_IR, CMD_OP_IR_CODE), IR_code);
        }
    }
    else
    {
        oppRFMsgRecvCallBack(data);
    }
    
}
#endif

#if PROJECTOR_CUBE
void AppControlCubeHandle(uint8_t *data)
{
    uint16_t IR_code = 0;
    uint8_t pId,fId,keyval;
    PROGRAMS_TYPE_E ptype;

    if(UsartType2.RX_Size<20)
    {
        if(data[9]==0xd && data[10]==0x3 && data[11]==0x0)
        {
            //runFlag = !runFlag;
            IR_code = REMOTE_MI_OK;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = false;
        }
        else if(data[9]==0x11 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_POWER;
            powerFlag = true;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x3)
        {
            IR_code = REMOTE_MI_UP;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x2)
        {
            IR_code = REMOTE_MI_HOME;
        }
        else if(data[9]==0xd && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_DOWN;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_PLUS;
        }
        else if(data[9]==0x13 && data[10]==0x3 && data[11]==0x1)
        {
            IR_code = REMOTE_MI_MINUS;
        }

        if (IR_code) {
            Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_IR, CMD_OP_IR_CODE), IR_code);
        }
    }
    else
    {
        oppRFMsgRecvCallBack(data);
    }
    /*
    ptype = *key++;
    pId = *key++;
    fId = *key;

    printf("AppControlCubeHandle type:%d,pid:%d,fid:%d\r\n",ptype,pId,fId);

    switch(ptype)
    {
        case PHOTO:
            runFlag = 1;
            photoProgramIdx = pId;
            programsType = PHOTO;
            break;

        case FILM:
            runFlag = 1;
            filmProgramIdx = pId;
            filmFrameIdx = fId;
            programsType = FILM;
            break;

        case AUTO_ALGORITHM:
            programsType = AUTO_ALGORITHM;
            
        default:
            break;
    }
    */
}

typedef struct {
    u8 src_sno;
    u8 dest_sno;
    u8 data_length;
    u16 group_number;
    u16 msg_id;
    u8 data[128];
} OPPLE_APP_MSG;

void AppComposeMsg(uint8_t haha)
{

    uint8_t blePadMsg[16] = {0x60, 0x5f, 0xff,
                            0xff, 0xfc,
                            0xff, 0x0c,
                            0x60, 0x5f, 0x33, 0x33, 0x11, 0x00, 0x00, 0x00, 0x00};

    memcpy(gOppBleMsg.msgBuf, blePadMsg, sizeof(blePadMsg));
    gOppBleMsg.msgHeader.pst.ucMsgLen = sizeof(blePadMsg);

}
#endif


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
